{"keras_version": "2.0.6", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"activity_regularizer": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "recurrent_activation": "hard_sigmoid", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "unroll": false, "batch_input_shape": [null, 1, 1], "bias_constraint": null, "implementation": 0, "stateful": false, "recurrent_dropout": 0.0, "unit_forget_bias": true, "go_backwards": false, "return_sequences": false, "dropout": 0.0, "use_bias": true, "name": "lstm_1", "kernel_constraint": null, "recurrent_regularizer": null, "dtype": "float32", "units": 4, "return_state": false, "bias_regularizer": null, "kernel_regularizer": null, "activation": "tanh"}}, {"class_name": "Dense", "config": {"activity_regularizer": null, "units": 1, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}}, "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null}}], "backend": "tensorflow"}